#+title: Trilinos notes
#+date: <2021-04-18 Sun>
#+author: Nasser Alkmim
#+email: nasser.alkmim@gmail.com
#+tags[]: tools trilinos 
#+toc: t
#+draft: t
*** Check required packages

#+begin_src shell
apt list --installed | egrep "gcc|gfortran|mpi|cmake"
#+end_src

#+RESULTS:
#+begin_example
cmake-data/focal,now 3.16.3-1ubuntu1 all [installed,automatic]
cmake/focal,now 3.16.3-1ubuntu1 amd64 [installed]
gcc-10-base/focal,now 10.3.0-1ubuntu1~20.04~2 amd64 [installed,automatic]
gcc-10/focal,now 10.3.0-1ubuntu1~20.04~2 amd64 [installed]
gcc-9-base/focal,now 9.3.0-25ubuntu1~20.04 amd64 [installed,automatic]
gcc-9/focal,now 9.3.0-25ubuntu1~20.04 amd64 [installed,automatic]
gcc/focal,now 4:9.3.0-1ubuntu2 amd64 [installed]
gfortran-9/focal,now 9.3.0-25ubuntu1~20.04 amd64 [installed,automatic]
gfortran/focal,now 4:9.3.0-1ubuntu2 amd64 [installed,automatic]
lib32gcc-s1/focal,now 10.3.0-1ubuntu1~20.04~2 amd64 [installed,automatic]
libgcc-10-dev/focal,now 10.3.0-1ubuntu1~20.04~2 amd64 [installed,automatic]
libgcc-9-dev/focal,now 9.3.0-25ubuntu1~20.04 amd64 [installed,automatic]
libgcc-s1/focal,now 10.3.0-1ubuntu1~20.04~2 amd64 [installed,automatic]
libgccjit-9-dev/focal,now 9.3.0-25ubuntu1~20.04 amd64 [installed]
libgccjit0/focal,now 10.3.0-1ubuntu1~20.04~2 amd64 [installed,automatic]
libgfortran-9-dev/focal,now 9.3.0-25ubuntu1~20.04 amd64 [installed,automatic]
libgfortran5/focal,now 10.3.0-1ubuntu1~20.04~2 amd64 [installed,automatic]
libmpich-dev/focal,now 3.3.2-2build1 amd64 [installed,automatic]
libmpich12/focal,now 3.3.2-2build1 amd64 [installed,automatic]
libparams-validationcompiler-perl/focal,now 0.30-1 all [installed,automatic]
mpich/focal,now 3.3.2-2build1 amd64 [installed]
node-pumpify/focal,now 2.0.1-1 all [installed,automatic]
#+end_example

** Extra dependencies

I got errors saying that some dependences were missing.

1. BLAS and LAPACK =sudo apt install libblas-dev liblapack-dev= (**)
2. netcdf =sudo apt install libnetcdf-dev=
3. for pytrilinos had to install SWIG =sudo apt install swig= (*)
4. also had to install Boost =sudo apt install libboost-dev=
5. Ninja build tool (instead of make) =sudo apt install ninja-build=

(*) SWIG is a simplified wrapper and interface generator that connects C++ with python (and other languages).

(**) BLAS and LAPACK are linear algebra software.

Check requirements
#+begin_src shell
apt list --installed | egrep "blas|lapack|swig|boost|netcdf|ninja"
#+end_src

#+RESULTS:
#+begin_example
libblas-dev/focal,now 3.9.0-1build1 amd64 [installed]
libblas3/focal,now 3.9.0-1build1 amd64 [installed,automatic]
libboost-dev/focal,now 1.71.0.0ubuntu2 amd64 [installed]
libboost1.71-dev/focal,now 1.71.0-6ubuntu6 amd64 [installed,automatic]
liblapack-dev/focal,now 3.9.0-1build1 amd64 [installed]
liblapack3/focal,now 3.9.0-1build1 amd64 [installed,automatic]
libnetcdf-dev/focal,now 1:4.7.3-1 amd64 [installed]
libnetcdf15/focal,now 1:4.7.3-1 amd64 [installed,automatic]
ninja-build/focal,now 1.10.0-1build1 amd64 [installed]
swig4.0/focal,now 4.0.1-5build1 amd64 [installed,automatic]
swig/focal,now 4.0.1-5build1 all [installed]
#+end_example

*** Python install path

To direct the PyTrilinos files into a folder where python can find.

#+begin_src shell
python -m site
#+end_src

#+RESULTS:
#+begin_example
sys.path = [
    '/mnt/c/Users/c8441205/OneDrive/nasser-website/content/notes/trilinos-notes',
    '/usr/lib/python38.zip',
    '/usr/lib/python3.8',
    '/usr/lib/python3.8/lib-dynload',
    '/home/nasser/.local/lib/python3.8/site-packages',
    '/usr/local/lib/python3.8/dist-packages',
    '/usr/lib/python3/dist-packages',
]
USER_BASE: '/home/nasser/.local' (exists)
USER_SITE: '/home/nasser/.local/lib/python3.8/site-packages' (exists)
ENABLE_USER_SITE: True
#+end_example

I'm using =-D PyTrilinos_INSTALL_PREFIX=/home/nasser/.local=.


** Build

Call =make -j12=.
About 10min on 12 processors.

#+begin_src shell
neofetch
#+end_src

#+RESULTS:
#+begin_example
[?25l[?7l[0m[31m[1m            .-/+oossssoo+/-.
        `:+ssssssssssssssssss+:`
      -+ssssssssssssssssssyyssss+-
    .ossssssssssssssssss[37m[0m[1mdMMMNy[0m[31m[1msssso.
   /sssssssssss[37m[0m[1mhdmmNNmmyNMMMMh[0m[31m[1mssssss/
  +sssssssss[37m[0m[1mhm[0m[31m[1myd[37m[0m[1mMMMMMMMNddddy[0m[31m[1mssssssss+
 /ssssssss[37m[0m[1mhNMMM[0m[31m[1myh[37m[0m[1mhyyyyhmNMMMNh[0m[31m[1mssssssss/
.ssssssss[37m[0m[1mdMMMNh[0m[31m[1mssssssssss[37m[0m[1mhNMMMd[0m[31m[1mssssssss.
+ssss[37m[0m[1mhhhyNMMNy[0m[31m[1mssssssssssss[37m[0m[1myNMMMy[0m[31m[1msssssss+
oss[37m[0m[1myNMMMNyMMh[0m[31m[1mssssssssssssss[37m[0m[1mhmmmh[0m[31m[1mssssssso
oss[37m[0m[1myNMMMNyMMh[0m[31m[1msssssssssssssshmmmh[0m[31m[1mssssssso
+ssss[37m[0m[1mhhhyNMMNy[0m[31m[1mssssssssssss[37m[0m[1myNMMMy[0m[31m[1msssssss+
.ssssssss[37m[0m[1mdMMMNh[0m[31m[1mssssssssss[37m[0m[1mhNMMMd[0m[31m[1mssssssss.
 /ssssssss[37m[0m[1mhNMMM[0m[31m[1myh[37m[0m[1mhyyyyhdNMMMNh[0m[31m[1mssssssss/
  +sssssssss[37m[0m[1mdm[0m[31m[1myd[37m[0m[1mMMMMMMMMddddy[0m[31m[1mssssssss+
   /sssssssssss[37m[0m[1mhdmNNNNmyNMMMMh[0m[31m[1mssssss/
    .ossssssssssssssssss[37m[0m[1mdMMMNy[0m[31m[1msssso.
      -+sssssssssssssssss[37m[0m[1myyy[0m[31m[1mssss+-
        `:+ssssssssssssssssss+:`
            .-/+oossssoo+/-.[0m
[20A[9999999D[43C[0m[1m[31m[1mnasser[0m@[31m[1mlt135-c842[0m 
[43C[0m-----------------[0m 
[43C[0m[31m[1mOS[0m[0m:[0m Ubuntu 20.04.2 LTS on Windows 10 x86_64[0m 
[43C[0m[31m[1mKernel[0m[0m:[0m 5.4.72-microsoft-standard-WSL2[0m 
[43C[0m[31m[1mUptime[0m[0m:[0m 2 days, 41 mins[0m 
[43C[0m[31m[1mPackages[0m[0m:[0m 1698 (dpkg)[0m 
[43C[0m[31m[1mShell[0m[0m:[0m bash 5.0.17[0m 
[43C[0m[31m[1mResolution[0m[0m:[0m 4096x1440[0m 
[43C[0m[31m[1mTheme[0m[0m:[0m Adwaita [GTK3][0m 
[43C[0m[31m[1mIcons[0m[0m:[0m Adwaita [GTK3][0m 
[43C[0m[31m[1mTerminal[0m[0m:[0m emacs[0m 
[43C[0m[31m[1mCPU[0m[0m:[0m AMD Ryzen 5 PRO 4650U with Radeon Graphics (12) @ 2.095GHz[0m 
[43C[0m[31m[1mMemory[0m[0m:[0m 335MiB / 11978MiB[0m 

[43C[30m[40m   [31m[41m   [32m[42m   [33m[43m   [34m[44m   [35m[45m   [36m[46m   [37m[47m   [m
[43C[38;5;8m[48;5;8m   [38;5;9m[48;5;9m   [38;5;10m[48;5;10m   [38;5;11m[48;5;11m   [38;5;12m[48;5;12m   [38;5;13m[48;5;13m   [38;5;14m[48;5;14m   [38;5;15m[48;5;15m   [m





[?25h[?7h
#+end_example

** Trilinos packages installed

After building the project.
The following packages are available in the build folder.

#+begin_src shell
cd ~/trilinos/build/packages
ls
#+end_src

#+RESULTS:
#+begin_example
PyTrilinos
amesos
amesos2
anasazi
aztecoo
belos
common
domi
epetra
epetraext
galeri
ifpack
ifpack2
isorropia
kokkos
kokkos-kernels
komplex
ml
nox
pamgen
pliris
rtop
seacas
shards
shylu
stk
stratimikos
teko
teuchos
thyra
tpetra
triutils
xpetra
zoltan
zoltan2
#+end_example

** Installing
=sudo make install= to install (copying to the right location).

After configuration, build and installing you should have a bin, include and lib folder in the specified installation folder.

#+begin_src shell
cd /usr/local/lib
ls | egrep "azt"
#+end_src

#+RESULTS:
: libaztecoo.so
: libaztecoo.so.13
: libaztecoo.so.13.1
: libstratimikosaztecoo.so
: libstratimikosaztecoo.so.13
: libstratimikosaztecoo.so.13.1

In the lib folder there is a python folder with the python library files.

